---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.IExtElemChangeBeamSection
source: html/97ec6549-b291-9d09-f7e7-3873d41ef169.htm
---
# IExtElemChangeBeamSection Members

The method that will be called when user wants to change beam section